SHE=["S","H","E"]
zifu=["温柔","自信","勇气"]
flh=["A","B","C","D"]
S,H,E=zifu
puts "\n第一个puts执行的结果是：","S代表的是"+S,"H代表的是"+H,"E代表的是"+E
S,H,E=flh
puts "\n第二个puts执行的结果是：","S和"+S+"搭档","H和"+H+"搭档","E和"+E+"搭档"
S,H,*E=flh
puts "\n第三个puts执行的结果是：","S和"+S+"搭档","H和"+H+"搭档","E可以和",E,"任何一个搭档"
S,*H,E=flh
puts "\n第四个puts执行的结果是：","S和"+S+"搭档","H可以和",H,"任何一个搭档","E和"+E+"搭档"
*S,H,E=flh
puts "\n第五个puts执行的结果是：","S可以和",S,"任何一个搭档","H和"+H+"搭档","E和"+E+"搭档"
a,b,c,d=flh
puts "\n第六个puts执行的结果是：","a代表的是"+a,"b代表的是"+b,"c代表的是"+c,"d代表的是"+d
a,(b,c),d=SHE
puts "\n第七个puts执行的结果是：","A和",a,"搭档","B和",b,"搭档","C和",c,"搭档","D和",d,"搭档"
a,(b,*c),d="S",["H","E"]
puts "\n第八个puts执行的结果是：","A和",a,"搭档","B和",b,"搭档","C和",c,"搭档","D和",d,"搭档"